app/Controllers/Home.php

    public function post($id){


        $data["page_title"] = "Новость";
        $this->builder->select('post_name, content, posts.post_img, posts.date, users.name, users.surname');
        $this->builder->join('Users', 'posts.user_id = Users.id');
        $result = $this->builder->where('posts.id',$id)->get();
---
SELECT `post_name`, `content`, `posts`.`post_img`, `posts`.`date`, `users`.`name`, `users`.`surname`
FROM `posts`
JOIN `Users` ON `posts`.`user_id` = `Users`.`id`
WHERE `posts`.`id` = '2'